{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**Теория:**\n",
    "\n",
    "**Идея сортировки выбором:**\n",
    "\n",
    "Сортировка выбором улучшает пузырьковую сортировку, совершая всего один обмен за каждый проход по списку. Для этого алгоритм ищет наибольший элемент и помещает его на соответствующую позицию. Как и для пузырьковой сортировки, после первого прохода самый большой элемент находится на правильном месте. После второго - на своё место становится следующий наибольший элемент. Процесс продолжается, требуя n−1 проходов для сортировки n элементов, поскольку последний из них автоматически оказывается на своём месте.\n",
    "\n",
    "**Алгоритм:**\n",
    "\n",
    "Алгоритм состоит из повторяющихся проходов по сортируемому массиву. За каждый проход находится наибольший элемент и выполняется один обмен наибольшего элемента и элемента на соответствующей позиции. Проходы по массиву повторяются N−1 раз. При каждом проходе алгоритма, очередной наибольший элемент массива ставится на своё место в конце массива рядом с предыдущим «наибольшим элементом».\n",
    "\n",
    "**Реализация:**\n",
    "\n",
    "```\n",
    "def selection_sort(array):\n",
    "    for i in range(len(array) - 1, 0, -1): # на какое место будем ставим наибольший элемент\n",
    "        maxIndex = i # индекс максимального элемента\n",
    "        for j in range(i): # проходим по не отсортированной последовательности\n",
    "\t    if array[j] > array[maxIndex]: # ищем максимальный элемент\n",
    "\t\tmaxIndex = j # запоминаем индекс\t\t\n",
    "\t\n",
    "\t# если нашли максимальный элемент, отличный от текущего числа\n",
    "\tif maxIndex != i:\n",
    "\t    # меняем местами\n",
    "\t    temp = array[maxIndex]\n",
    "\t    array[maxIndex] = array[i]\n",
    "\t    array[i] = temp\n",
    "```\n",
    "\n",
    "**Свойства алгоритма сортировки пузырьком:**\n",
    "\n",
    "- Устойчивость - Нет - При перестановке элементов нельзя гарантировать, что не поменяются элементы с одинаковыми ключами\n",
    "- Внутренняя/внешняя сортировка - Внутренняя - Нужно несколько раз пробегать по последовательности\n",
    "- Естественность поведения - Нет - Каждый нужно находить максимальный элемент\n",
    "\n",
    "**Временная сложность:**\n",
    "\n",
    "- Лучшее - O(n в 2) - Алгоритм всегда находит максимальный элемент на каждом проходе, независимо от упорядоченности элементов\n",
    "- В среднем - O(n в 2) - В среднем этот алгоритм требует n в 2 итераций цикла\n",
    "- В худшем - O(n в 2) - Алгоритм всегда находит максимальный элемент на каждом проходе\n",
    "\n",
    "-----"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**Задача:** Напишите программу, которая сортирует массив по неубыванию с помощью сортировки выбором."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 6 7 8 11 12 14 18 19 20\n"
     ]
    }
   ],
   "source": [
    "arr = [11, 7, 12, 14, 19, 1, 6, 18, 8, 20]\n",
    "\n",
    "for i in range(len(arr)-1, 0, -1):\n",
    "    maxIndex = i\n",
    "    for j in range(i): \n",
    "        if arr[j] > arr[maxIndex]:\n",
    "            maxIndex = j\n",
    "    \n",
    "    if maxIndex != i:\n",
    "        temp = arr[maxIndex]\n",
    "        arr[maxIndex] = arr[i]\n",
    "        arr[i] = temp\n",
    "\n",
    "print(*arr)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**Задача:** Напишите программу, которая сортирует массив по невозрастанию с помощью сортировки выбором."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "20 19 18 14 12 11 8 7 6 1\n"
     ]
    }
   ],
   "source": [
    "arr = [11, 7, 12, 14, 19, 1, 6, 18, 8, 20]\n",
    "\n",
    "for i in range(len(arr)-1, 0, -1):\n",
    "    maxIndex = i\n",
    "    for j in range(i): \n",
    "        if arr[j] < arr[maxIndex]:\n",
    "            maxIndex = j\n",
    "    \n",
    "    if maxIndex != i:\n",
    "        temp = arr[maxIndex]\n",
    "        arr[maxIndex] = arr[i]\n",
    "        arr[i] = temp\n",
    "\n",
    "print(*arr)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**Задача:** В 39 школе в 7Б классе учатся N учеников. Недавно они писали проверочную работу по информатике. Определите трех учеников с наилучшими баллами. Выведите фамилии и имена этих учащихся в порядке убывания их баллов. Известно, что у всех учеников разные баллы."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "n_cnt = int(input())\n",
    "list_with_value = list()\n",
    "dict_with_value = dict()\n",
    "\n",
    "for i in range(n_cnt):\n",
    "    list_with_value.append(input())\n",
    "\n",
    "for i in list_with_value:\n",
    "    dict_with_value[int(i.split()[2])] = ' '.join(i.split()[:2])\n",
    "\n",
    "for i in sorted([i for i in dict_with_value], reverse=True)[:3]:\n",
    "    print(dict_with_value[i])"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
